In [1]:
import numpy as np
import pandas as pd

In [5]:
mom = pd.read_csv('../Data/build_37_dna/Mom_37.csv')

/Users/Dad/.virtualenvs/pandas/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3020: DtypeWarning: Columns (1,2) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [6]:
mom.head()

         RSID CHROMOSOME POSITION RESULT
0   rs4477212          1    82154     AA
1   rs3094315          1   752566     AA
2   rs3131972          1   752721     GG
3  rs12562034          1   768448     --
4  rs12124819          1   776546     GG

In [8]:
martin = pd.read_csv('../Data/build_37_dna/Martin_37.csv')

In [9]:
martin.head()

         RSID CHROMOSOME POSITION RESULT
0   rs4477212          1    82154     AA
1   rs3094315          1   752566     --
2   rs3131972          1   752721     GG
3  rs12562034          1   768448     --
4  rs12124819          1   776546     --

In [10]:
len(martin)

720351

In [11]:
len(mom)

720450

In [17]:
merged_left = pd.merge(left=mom,right=martin[['RSID', 'RESULT']], how='left', left_on='RSID', right_on='RSID')

In [18]:
merged_left.head()

         RSID CHROMOSOME POSITION RESULT_x RESULT_y
0   rs4477212          1    82154       AA       AA
1   rs3094315          1   752566       AA       --
2   rs3131972          1   752721       GG       GG
3  rs12562034          1   768448       --       --
4  rs12124819          1   776546       GG       --

In [20]:
len(merged_left)

720450

In [21]:
merged_left.tail()

              RSID CHROMOSOME   POSITION RESULT_x RESULT_y
720445    rs659139          X  154898561       CC       CC
720446    rs669237          X  154916845       --       --
720447  rs35842692          X    4935714       AA       AC
720448  rs35361563          X    5411068       GG       AG
720449  rs17883004          X    1410495       AG       GG

In [22]:
mom.tail()

              RSID CHROMOSOME   POSITION RESULT
720445    rs659139          X  154898561     CC
720446    rs669237          X  154916845     --
720447  rs35842692          X    4935714     AA
720448  rs35361563          X    5411068     GG
720449  rs17883004          X    1410495     AG

In [18]:
merged_left.to_csv('test.csv')

In [23]:
print(merged_left.loc[[94]])

         RSID CHROMOSOME POSITION RESULT_x RESULT_y
94  rs6685064          1  1211292       CC      NaN

In [24]:
ml = merged_left.replace(np.nan, '--', regex=True)

In [25]:
print(ml.loc[[94]])

         RSID CHROMOSOME POSITION RESULT_x RESULT_y
94  rs6685064          1  1211292       CC       --

In [26]:
ml.head()

         RSID CHROMOSOME POSITION RESULT_x RESULT_y
0   rs4477212          1    82154       AA       AA
1   rs3094315          1   752566       AA       --
2   rs3131972          1   752721       GG       GG
3  rs12562034          1   768448       --       --
4  rs12124819          1   776546       GG       --

In [27]:
rml = ml.rename(index=str, columns={"RESULT_x": "Mom", "RESULT_y": "Martin"})

In [28]:
rml.head()

         RSID CHROMOSOME POSITION Mom Martin
0   rs4477212          1    82154  AA     AA
1   rs3094315          1   752566  AA     --
2   rs3131972          1   752721  GG     GG
3  rs12562034          1   768448  --     --
4  rs12124819          1   776546  GG     --

In [30]:
rml.tail()

              RSID CHROMOSOME   POSITION Mom Martin
720445    rs659139          X  154898561  CC     CC
720446    rs669237          X  154916845  --     --
720447  rs35842692          X    4935714  AA     AC
720448  rs35361563          X    5411068  GG     AG
720449  rs17883004          X    1410495  AG     GG

In [31]:
def get_common_allele (row):
    # (<Mom>, <Martin>):<Common>,
    mom2Child = { ("AA", "AA"):"AA",
                  ("AA", "AC"):"AA",
                  ("AA", "AG"):"AA",
                  ("AA", "AT"):"AA",
                  ("AA", "CC"):"AA",
                  ("AA", "GG"):"AA",
                  ("AA", "--"):"AA",
                  ("AC", "AA"):"AA",
                  ("AC", "AC"):"--",
                  ("AC", "CC"):"CC",
                  ("AC", "--"):"--",
                  ("AG", "AA"):"AA",
                  ("AG", "AG"):"--",
                  ("AG", "GG"):"GG",
                  ("AG", "--"):"--",
                  ("AT", "AA"):"AA",
                  ("AT", "AT"):"--",
                  ("AT", "TT"):"TT",
                  ("AT", "--"):"--",
                  ("CC", "AA"):"CC",
                  ("CC", "AC"):"CC",
                  ("CC", "CC"):"CC",
                  ("CC", "CG"):"CC",
                  ("CC", "CT"):"CC",
                  ("CC", "TT"):"CC",
                  ("CC", "--"):"CC",
                  ("CC", "GG"):"CC",
                  ("CG", "CC"):"CC",
                  ("CG", "CG"):"--",
                  ("CG", "GG"):"CC",
                  ("CG", "--"):"--",
                  ("CT", "CC"):"CC",
                  ("CT", "CT"):"--",
                  ("CT", "TT"):"TT",
                  ("CT", "--"):"--",
                  ("GG", "AA"):"GG",
                  ("GG", "AG"):"GG",
                  ("GG", "CG"):"GG",
                  ("GG", "GG"):"GG",
                  ("GG", "GT"):"GG",
                  ("GG", "TT"):"GG",
                  ("GG", "--"):"GG",
                  ("GT", "GG"):"GG",
                  ("GT", "GT"):"--",
                  ("GT", "TT"):"TT",
                  ("GT", "--"):"--",
                  ("TT", "AT"):"TT",
                  ("TT", "CC"):"TT",
                  ("TT", "CT"):"TT",
                  ("TT", "GG"):"TT",
                  ("TT", "GT"):"TT",
                  ("TT", "TT"):"TT",
                  ("TT", "--"):"TT",
                  ("--", "AA"):"AA",
                  ("--", "AC"):"--",
                  ("--", "AG"):"--",
                  ("--", "AT"):"--",
                  ("--", "CC"):"CC",
                  ("--", "CG"):"--",
                  ("--", "CT"):"--",
                  ("--", "GG"):"GG",
                  ("--", "GT"):"--",
                  ("--", "TT"):"TT",
                  ("--", "--"):"--",
                  ("RESULT", "RESULT"):"RESULT"
                }
    return mom2Child[(row['Mom'], row['Martin'])]

In [32]:
rml['RESULT'] = rml.apply (lambda row: get_common_allele (row),axis=1)

In [33]:
rml.head()

         RSID CHROMOSOME POSITION Mom Martin RESULT
0   rs4477212          1    82154  AA     AA     AA
1   rs3094315          1   752566  AA     --     AA
2   rs3131972          1   752721  GG     GG     GG
3  rs12562034          1   768448  --     --     --
4  rs12124819          1   776546  GG     --     GG

In [34]:
rml.tail()

              RSID CHROMOSOME   POSITION Mom Martin RESULT
720445    rs659139          X  154898561  CC     CC     CC
720446    rs669237          X  154916845  --     --     --
720447  rs35842692          X    4935714  AA     AC     AA
720448  rs35361563          X    5411068  GG     AG     GG
720449  rs17883004          X    1410495  AG     GG     GG

In [35]:
MomAndMartin = rml.drop(['Mom', 'Martin'], axis=1)

In [36]:
MomAndMartin.head()

         RSID CHROMOSOME POSITION RESULT
0   rs4477212          1    82154     AA
1   rs3094315          1   752566     AA
2   rs3131972          1   752721     GG
3  rs12562034          1   768448     --
4  rs12124819          1   776546     GG

In [32]:
first_column = MomAndMartin.columns[0]

In [54]:
MomAndMartin.to_csv('MomAndMartin.csv.gz', compression='gzip')

In [73]:
MomAndMartin.to_csv('MomAndMartin.csv.gz', compression='gzip', index=False)

In [33]:
def get_other_allele (row):
    # (<Mom>, <Martin>):<EvilTwin>,
    mom2EvilTwin = { ("AA", "AA"):"AA",
                  ("AA", "AC"):"AA",
                  ("AA", "AG"):"AA",
                  ("AA", "AT"):"AA",
                  ("AA", "CC"):"AA",
                  ("AA", "GG"):"AA",
                  ("AA", "--"):"AA",
                  ("AC", "AA"):"CC",
                  ("AC", "AC"):"--",
                  ("AC", "CC"):"AA",
                  ("AC", "--"):"--",
                  ("AG", "AA"):"GG",
                  ("AG", "AG"):"--",
                  ("AG", "GG"):"AA",
                  ("AG", "--"):"--",
                  ("AT", "AA"):"TT",
                  ("AT", "AT"):"--",
                  ("AT", "TT"):"AA",
                  ("AT", "--"):"--",
                  ("CC", "AA"):"CC",
                  ("CC", "AC"):"CC",
                  ("CC", "CC"):"CC",
                  ("CC", "CG"):"CC",
                  ("CC", "CT"):"CC",
                  ("CC", "TT"):"CC",
                  ("CC", "--"):"CC",
                  ("CC", "GG"):"CC",
                  ("CG", "CC"):"GG",
                  ("CG", "CG"):"--",
                  ("CG", "GG"):"CC",
                  ("CG", "--"):"--",
                  ("CT", "CC"):"TT",
                  ("CT", "CT"):"--",
                  ("CT", "TT"):"CC",
                  ("CT", "--"):"--",
                  ("GG", "AA"):"GG",
                  ("GG", "AG"):"GG",
                  ("GG", "CG"):"GG",
                  ("GG", "GG"):"GG",
                  ("GG", "GT"):"GG",
                  ("GG", "TT"):"GG",
                  ("GG", "--"):"GG",
                  ("GT", "GG"):"TT",
                  ("GT", "GT"):"--",
                  ("GT", "TT"):"GG",
                  ("GT", "--"):"--",
                  ("TT", "AT"):"TT",
                  ("TT", "CC"):"TT",
                  ("TT", "CT"):"TT",
                  ("TT", "GG"):"TT",
                  ("TT", "GT"):"TT",
                  ("TT", "TT"):"TT",
                  ("TT", "--"):"TT",
                  ("--", "AA"):"--",
                  ("--", "AC"):"--",
                  ("--", "AG"):"--",
                  ("--", "AT"):"--",
                  ("--", "CC"):"--",
                  ("--", "CG"):"--",
                  ("--", "CT"):"--",
                  ("--", "GG"):"--",
                  ("--", "GT"):"--",
                  ("--", "TT"):"--",
                  ("--", "--"):"--",
                  ("RESULT", "RESULT"):"RESULT"
                }
    return mom2EvilTwin[(row['Mom'], row['Martin'])]

In [34]:
rml['RESULT'] = rml.apply (lambda row: get_other_allele (row),axis=1)

In [35]:
rml.head()

         RSID CHROMOSOME POSITION Mom Martin RESULT
0   rs4477212          1    82154  AA     AA     AA
1   rs3094315          1   752566  AA     --     AA
2   rs3131972          1   752721  GG     GG     GG
3  rs12562034          1   768448  --     --     --
4  rs12124819          1   776546  GG     --     GG

In [36]:
MartinsEvilTwin = rml.drop(['Mom', 'Martin'], axis=1)

In [37]:
MartinsEvilTwin.head()

         RSID CHROMOSOME POSITION RESULT
0   rs4477212          1    82154     AA
1   rs3094315          1   752566     AA
2   rs3131972          1   752721     GG
3  rs12562034          1   768448     --
4  rs12124819          1   776546     GG

In [75]:
MartinsEvilTwin.to_csv('MartinsEvilTwin.csv.gz', compression='gzip', index=False)

In [38]:
rml.head()

         RSID CHROMOSOME POSITION Mom Martin RESULT
0   rs4477212          1    82154  AA     AA     AA
1   rs3094315          1   752566  AA     --     AA
2   rs3131972          1   752721  GG     GG     GG
3  rs12562034          1   768448  --     --     --
4  rs12124819          1   776546  GG     --     GG

In [39]:
rml.tail()

              RSID CHROMOSOME   POSITION Mom Martin RESULT
720445    rs659139          X  154898561  CC     CC     CC
720446    rs669237          X  154916845  --     --     --
720447  rs35842692          X    4935714  AA     AC     AA
720448  rs35361563          X    5411068  GG     AG     GG
720449  rs17883004          X    1410495  AG     GG     AA

In [40]:
def get_dads_allele (row):
    # (<Mom>, <Martin>):<Dad>,
    dadFromMom= { ("AA", "AA"):"A",
                  ("AA", "AC"):"C",
                  ("AA", "AG"):"G",
                  ("AA", "AT"):"T",
                  ("AA", "CC"):"-",
                  ("AA", "GG"):"-",
                  ("AA", "--"):"-",
                  ("AC", "AA"):"A",
                  ("AC", "AC"):"-",
                  ("AC", "CC"):"C",
                  ("AC", "--"):"-",
                  ("AG", "AA"):"A",
                  ("AG", "AG"):"-",
                  ("AG", "GG"):"G",
                  ("AG", "--"):"-",
                  ("AT", "AA"):"A",
                  ("AT", "AT"):"-",
                  ("AT", "TT"):"T",
                  ("AT", "--"):"-",
                  ("CC", "AA"):"-",
                  ("CC", "AC"):"A",
                  ("CC", "CC"):"C",
                  ("CC", "CG"):"G",
                  ("CC", "CT"):"T",
                  ("CC", "TT"):"-",
                  ("CC", "--"):"-",
                  ("CC", "GG"):"-",
                  ("CG", "CC"):"C",
                  ("CG", "CG"):"-",
                  ("CG", "GG"):"-",
                  ("CG", "--"):"-",
                  ("CT", "CC"):"C",
                  ("CT", "CT"):"-",
                  ("CT", "TT"):"T",
                  ("CT", "--"):"-",
                  ("GG", "AA"):"-",
                  ("GG", "AG"):"A",
                  ("GG", "CG"):"C",
                  ("GG", "GG"):"G",
                  ("GG", "GT"):"T",
                  ("GG", "TT"):"-",
                  ("GG", "--"):"-",
                  ("GT", "GG"):"G",
                  ("GT", "GT"):"-",
                  ("GT", "TT"):"T",
                  ("GT", "--"):"-",
                  ("TT", "AT"):"A",
                  ("TT", "CC"):"_",
                  ("TT", "CT"):"C",
                  ("TT", "GG"):"-",
                  ("TT", "GT"):"G",
                  ("TT", "TT"):"T",
                  ("TT", "--"):"-",
                  ("--", "AA"):"-",
                  ("--", "AC"):"-",
                  ("--", "AG"):"-",
                  ("--", "AT"):"-",
                  ("--", "CC"):"-",
                  ("--", "CG"):"-",
                  ("--", "CT"):"-",
                  ("--", "GG"):"-",
                  ("--", "GT"):"-",
                  ("--", "TT"):"-",
                  ("--", "--"):"-",
                  ("RESULT", "RESULT"):"RESULT"
                }
    return dadFromMom[(row['Mom'], row['Martin'])]